Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_can.h
/*
 * pic18f_q84_can.h
 *
 * CAN FD (Controller Area Network with Flexible Data-Rate) register
 * definitions for PIC18F27/47/57Q84 microcontrollers.
 *
 * The CAN FD module implements ISO 11898-1:2015 CAN FD and CAN 2.0B
 * protocols with the following features:
 *
 *   - CAN FD and CAN 2.0B operating modes
 *   - Bit rates up to 8 Mbit/s (data phase) and 1 Mbit/s (nominal)
 *   - Payload sizes up to 64 bytes per frame (CAN FD)
 *   - 1 dedicated TX FIFO queue (TXQ) with priority-based scheduling
 *   - 3 programmable TX/RX FIFOs (FIFO1-FIFO3)
 *   - 1 TX Event FIFO (TEF) for transmit-complete timestamps
 *   - 12 acceptance filters with individual masks
 *   - Transmitter delay compensation (TDC) for high data rates
 *   - Transmit bandwidth sharing (TXBWS) for fair bus access
 *   - ISO or non-ISO CRC selection
 *   - 32-bit time base counter with configurable prescaler
 *   - DeviceNet filter support (DNCNT)
 *   - Protocol exception event control
 *   - Listen-only, loopback, and restricted operation modes
 *
 * Register architecture:
 *   All CAN control/status registers (prefixed C1) are 32 bits wide,
 *   mapped at 4-byte-aligned addresses starting at 0x0100.  Each
 *   32-bit register can be accessed as a single 32-bit word via SFR32
 *   or as four individual bytes via SFR8 with the L/H/U/T suffixes:
 *     L = byte 0 (bits  7:0),  offset +0
 *     H = byte 1 (bits 15:8),  offset +1
 *     U = byte 2 (bits 23:16), offset +2
 *     T = byte 3 (bits 31:24), offset +3
 *
 * Message RAM:
 *   TX/RX message objects reside in a dedicated CAN message RAM area
 *   (separate from these SFR registers).  The FIFO user-address
 *   registers (C1TXQUA, C1FIFOUAn) point into that RAM.  Refer to
 *   DS40002213D Section 29 for message object format details.
 *
 * Typical CAN FD initialisation sequence:
 *   1. Request Configuration mode: C1CON REQOP = 0b100
 *   2. Wait for OPMOD == 0b100 (Configuration mode confirmed)
 *   3. Configure bit timing: C1NBTCFG (nominal), C1DBTCFG (data)
 *   4. Configure TDC: C1TDC (offset, mode, SID11 enable)
 *   5. Configure FIFOs: C1TXQCON, C1FIFOCON1-3 (sizes, directions)
 *   6. Configure TEF: C1TEFCON (if store-in-TEF enabled)
 *   7. Set FIFO base address: C1FIFOBA
 *   8. Configure filters/masks: C1FLTOBJn, C1MASKn, C1FLTCONn
 *   9. Enable interrupts: C1INT
 *  10. Request Normal CAN FD mode: C1CON REQOP = 0b000
 *  11. Wait for OPMOD == 0b000
 *
 * Reference: Microchip DS40002213D - PIC18F27/47/57Q84 Data Sheet
 *            Section 29: CAN FD Module
 *
 * Requires: SFR8(addr), SFR16(addr), and SFR32(addr) macros defined
 *           externally (typically via pic18f_q84.h).
 */

#ifndef PIC18F_Q84_CAN_H
#define PIC18F_Q84_CAN_H

/* =====================================================================
 *
 *  CAN FD Operation Mode Constants
 *
 *  Used with the REQOP field (to request a mode transition) and the
 *  OPMOD field (to read the current operating mode) in C1CON.
 *
 * =================================================================== */

#define CAN_MODE_NORMAL_FD 0x00u     /* Normal CAN FD mode             */
#define CAN_MODE_SLEEP 0x01u         /* Sleep / low-power mode         */
#define CAN_MODE_INT_LOOPBACK 0x02u  /* Internal Loopback (no bus)     */
#define CAN_MODE_LISTEN_ONLY 0x03u   /* Listen Only (no TX, no ACK)    */
#define CAN_MODE_CONFIGURATION 0x04u /* Configuration (registers R/W)  */
#define CAN_MODE_EXT_LOOPBACK 0x05u  /* External Loopback (TX->RX)    */
#define CAN_MODE_NORMAL_2_0 0x06u    /* Normal CAN 2.0B mode           */
#define CAN_MODE_RESTRICTED 0x07u    /* Restricted Operation mode      */

/* =====================================================================
 *
 *  CAN FD Payload Size Constants
 *
 *  Used with the PLSIZE field in C1TXQCON and C1FIFOCONn to select
 *  the data payload size per message object in the FIFO.
 *
 * =================================================================== */

#define CAN_PLSIZE_8 0x00u  /*  8 bytes (CAN 2.0B compatible) */
#define CAN_PLSIZE_12 0x01u /* 12 bytes                       */
#define CAN_PLSIZE_16 0x02u /* 16 bytes                       */
#define CAN_PLSIZE_20 0x03u /* 20 bytes                       */
#define CAN_PLSIZE_24 0x04u /* 24 bytes                       */
#define CAN_PLSIZE_32 0x05u /* 32 bytes                       */
#define CAN_PLSIZE_48 0x06u /* 48 bytes                       */
#define CAN_PLSIZE_64 0x07u /* 64 bytes (maximum CAN FD)      */

/* =====================================================================
 *
 *  CAN FD TX Retry Attempt Constants
 *
 *  Used with the TXAT field in C1TXQCON and C1FIFOCONn to control
 *  how many times a message is retransmitted after arbitration loss
 *  or error (when RTXAT is enabled in C1CON).
 *
 * =================================================================== */

#define CAN_TXAT_DISABLED 0x00u  /* Retransmit disabled            */
#define CAN_TXAT_3_RETRIES 0x01u /* Retransmit up to 3 times      */
#define CAN_TXAT_UNLIMITED 0x02u /* Unlimited retransmissions      */
/* 0x03 is reserved                                                      */

/* =====================================================================
 *
 *  CAN FD TDC Mode Constants
 *
 *  Used with the TDCMOD field in C1TDC to select the transmitter
 *  delay compensation mode for CAN FD data-phase bit rates.
 *
 * =================================================================== */

#define CAN_TDCMOD_DISABLED 0x00u /* TDC disabled                   */
#define CAN_TDCMOD_MANUAL 0x01u   /* Manual: use TDCO only          */
#define CAN_TDCMOD_AUTO 0x02u     /* Auto: TDCV measured + TDCO     */
/* 0x03 is reserved                                                      */

/* *********************************************************************
 *
 *  C1CON - CAN Module Control Register
 *  Address: 0x0100 (32-bit)
 *
 *  Master control register for the CAN FD module.  Provides clock
 *  selection, protocol options, TX bandwidth sharing, abort control,
 *  and operating mode request/status.
 *
 * ********************************************************************* */

#define C1CONL SFR8(0x0100) /* byte 0: bits  7:0        */
#define C1CONH SFR8(0x0101) /* byte 1: bits 15:8        */
#define C1CONU SFR8(0x0102) /* byte 2: bits 23:16       */
#define C1CONT SFR8(0x0103) /* byte 3: bits 31:24       */
#define C1CON SFR32(0x0100) /* full 32-bit access       */

/* --- Byte 0 (C1CONL, offset +0) --- */

/* Bits 4:0 - DNCNT[4:0]: DeviceNet Filter Bit Number
 *   Number of bits at the start of the frame to apply the DeviceNet
 *   filter.  Set to 0 to disable DeviceNet filtering.                  */
#define C1CON_DNCNT_POS 0
#define C1CON_DNCNT_MASK (0x1Fu << 0)

/* Bit 5 - ISOCRCEN: ISO CRC Enable
 *   1 = CRC field uses ISO 11898-1:2015 CAN FD format (stuff bit
 *       count included in CRC calculation).
 *   0 = CRC field uses non-ISO (Bosch) CAN FD format.
 *   Should match all other nodes on the bus.                           */
#define C1CON_ISOCRCEN (1u << 5)

/* Bit 6 - PXEDIS: Protocol Exception Event Disable
 *   1 = Protocol exception is disabled; the module treats a received
 *       FDF=1 (in CAN 2.0 mode) as a form error.
 *   0 = Protocol exception is enabled per ISO 11898-1:2015.            */
#define C1CON_PXEDIS (1u << 6)

/* Bit 7 - CLKSEL: CAN System Clock Select
 *   1 = CAN module uses the system clock (Fosc) directly.
 *   0 = CAN module uses the clock selected by the CAN clock divider.   */
#define C1CON_CLKSEL (1u << 7)

/* --- Byte 1 (C1CONH, offset +1) --- */

/* Bit 8 - RTXAT: Restrict Retransmission Attempts
 *   1 = Retransmission attempts are restricted per TXAT field in
 *       the FIFO control registers.
 *   0 = Message retransmits unlimited on arbitration loss or error.     */
#define C1CON_RTXAT (1u << 8)

