Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_can.h
/* Bit 9 - WAKFIL: CAN Bus Line Wake-up Filter Enable
 *   1 = Wake-up filter enabled on the CAN bus line.
 *   0 = Wake-up filter disabled.                                       */
#define C1CON_WAKFIL (1u << 9)

/* Bits 11:10 - WFT[1:0]: Wake-up Filter Time
 *   Selects the wake-up filter time when WAKFIL = 1.
 *   00 = T00FILT, 01 = T01FILT, 10 = T10FILT, 11 = T11FILT
 *   (Actual times are implementation-defined; see DS40002213D.)         */
#define C1CON_WFT_POS 10
#define C1CON_WFT_MASK (0x03u << 10)

/* --- Byte 2 (C1CONU, offset +2) --- */

/* Bit 16 - ABAT: Abort All Pending Transmissions
 *   Write 1 = Request abort of all pending transmissions.
 *             Hardware clears this bit when all TX FIFOs have been
 *             flushed and pending transmissions aborted.
 *   0 = No abort request / abort complete.                             */
#define C1CON_ABAT (1u << 16)

/* Bits 23:20 - TXBWS[3:0]: Transmit Bandwidth Sharing
 *   Controls the delay (in arbitration bit times) between consecutive
 *   transmission attempts from this node, providing fair access to
 *   other bus participants.
 *   0000 = No delay (back-to-back transmissions)
 *   0001-1011 = Delay of (value * 2) bit times
 *   1100-1111 = Reserved                                               */
#define C1CON_TXBWS_POS 20
#define C1CON_TXBWS_MASK (0x0Fu << 20)

/* --- Byte 3 (C1CONT, offset +3) --- */

/* Bits 26:24 - OPMOD[2:0]: Operation Mode Status (read-only)
 *   Reports the current operating mode of the CAN module.
 *   Use CAN_MODE_* constants for comparison.                           */
#define C1CON_OPMOD_POS 24
#define C1CON_OPMOD_MASK (0x07u << 24)

/* Bits 30:28 - REQOP[2:0]: Request Operation Mode
 *   Write the desired mode value to request a mode transition.
 *   The OPMOD field reflects the current mode after the transition
 *   completes.  Use CAN_MODE_* constants.                              */
#define C1CON_REQOP_POS 28
#define C1CON_REQOP_MASK (0x07u << 28)

/* Bit 27 - ESIGM: Transmit Error Signal Mode
 *   1 = Error frames are transmitted with ESI bit set in CAN FD
 *       frames when the module is in error passive state.
 *   0 = ESI bit reflects the transmitter's error state.                */
#define C1CON_ESIGM (1u << 27)

/* Bit 28 overlaps REQOP[0] -- see REQOP definition above */

/* Bit 29 - SERRLOM: System Error to Listen-Only Mode
 *   1 = On a system error, the module automatically transitions
 *       to Listen-Only mode.
 *   0 = System error does not cause mode transition.                   */
#define C1CON_SERRLOM (1u << 29)

/* Bit 30 - STEF: Store in Transmit Event FIFO
 *   1 = Successfully transmitted messages are stored in the TEF.
 *   0 = Transmitted messages are not stored in the TEF.                */
#define C1CON_STEF (1u << 30)

/* Bit 31 - BUSY: CAN Module Busy (read-only)
 *   1 = Module is actively transmitting or receiving.
 *   0 = Module is idle.                                                */
#define C1CON_BUSY (1u << 31)

/* *********************************************************************
 *
 *  C1NBTCFG - Nominal Bit Time Configuration
 *  Address: 0x0104 (32-bit)
 *
 *  Configures the nominal (arbitration phase) bit timing.  The nominal
 *  bit time = (SJW+1 + TSEG1+1 + TSEG2+1) time quanta, where each
 *  time quantum = (BRP+1) / Fcan.
 *
 * ********************************************************************* */

#define C1NBTCFGL SFR8(0x0104) /* byte 0: BRP[7:0]         */
#define C1NBTCFGH SFR8(0x0105) /* byte 1: TSEG1[7:0]       */
#define C1NBTCFGU SFR8(0x0106) /* byte 2: TSEG2[6:0]       */
#define C1NBTCFGT SFR8(0x0107) /* byte 3: SJW[6:0]         */
#define C1NBTCFG SFR32(0x0104) /* full 32-bit access       */

/* Bits 7:0 - BRP[7:0]: Baud Rate Prescaler
 *   Nominal bit rate prescaler.  Time quantum = (BRP+1) / Fcan.
 *   Range: 0-255 (divides by 1-256).                                   */
#define C1NBTCFG_BRP_POS 0
#define C1NBTCFG_BRP_MASK (0xFFu << 0)

/* Bits 15:8 - TSEG1[7:0]: Time Segment 1 (Propagation + Phase 1)
 *   Nominal TSEG1.  Number of TQ = TSEG1 + 1.
 *   Range: 0-255 (1-256 TQ).                                           */
#define C1NBTCFG_TSEG1_POS 8
#define C1NBTCFG_TSEG1_MASK (0xFFu << 8)

/* Bits 22:16 - TSEG2[6:0]: Time Segment 2 (Phase 2)
 *   Nominal TSEG2.  Number of TQ = TSEG2 + 1.
 *   Range: 0-127 (1-128 TQ).                                           */
#define C1NBTCFG_TSEG2_POS 16
#define C1NBTCFG_TSEG2_MASK (0x7Fu << 16)

/* Bits 30:24 - SJW[6:0]: Synchronization Jump Width
 *   Nominal SJW.  Maximum adjustment = SJW + 1 TQ.
 *   Range: 0-127 (1-128 TQ).                                           */
#define C1NBTCFG_SJW_POS 24
#define C1NBTCFG_SJW_MASK (0x7Fu << 24)

/* *********************************************************************
 *
 *  C1DBTCFG - Data Bit Time Configuration
 *  Address: 0x0108 (32-bit)
 *
 *  Configures the data phase bit timing (used in CAN FD frames during
 *  the data field when BRS=1).  The data bit time = (SJW+1 + TSEG1+1
 *  + TSEG2+1) time quanta, where TQ = (BRP+1) / Fcan.
 *
 * ********************************************************************* */

#define C1DBTCFGL SFR8(0x0108) /* byte 0: BRP[7:0]         */
#define C1DBTCFGH SFR8(0x0109) /* byte 1: TSEG1[4:0]       */
#define C1DBTCFGU SFR8(0x010A) /* byte 2: TSEG2[3:0]       */
#define C1DBTCFGT SFR8(0x010B) /* byte 3: SJW[3:0]         */
#define C1DBTCFG SFR32(0x0108) /* full 32-bit access       */

/* Bits 7:0 - BRP[7:0]: Data Baud Rate Prescaler
 *   Data phase prescaler.  TQ = (BRP+1) / Fcan.
 *   Range: 0-255 (divides by 1-256).                                   */
#define C1DBTCFG_BRP_POS 0
#define C1DBTCFG_BRP_MASK (0xFFu << 0)

/* Bits 12:8 - TSEG1[4:0]: Data Time Segment 1
 *   Data TSEG1.  Number of TQ = TSEG1 + 1.
 *   Range: 0-31 (1-32 TQ).                                             */
#define C1DBTCFG_TSEG1_POS 8
#define C1DBTCFG_TSEG1_MASK (0x1Fu << 8)

/* Bits 19:16 - TSEG2[3:0]: Data Time Segment 2
 *   Data TSEG2.  Number of TQ = TSEG2 + 1.
 *   Range: 0-15 (1-16 TQ).                                             */
#define C1DBTCFG_TSEG2_POS 16
#define C1DBTCFG_TSEG2_MASK (0x0Fu << 16)

/* Bits 27:24 - SJW[3:0]: Data Synchronization Jump Width
 *   Data SJW.  Maximum adjustment = SJW + 1 TQ.
 *   Range: 0-15 (1-16 TQ).                                             */
#define C1DBTCFG_SJW_POS 24
#define C1DBTCFG_SJW_MASK (0x0Fu << 24)

