Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_can.h
/* *********************************************************************
 *
 *  C1TDC - Transmitter Delay Compensation
 *  Address: 0x010C (32-bit)
 *
 *  Controls transmitter delay compensation (TDC) for reliable data
 *  phase reception at high bit rates.  TDC compensates for the
 *  round-trip delay through the transceiver.
 *
 * ********************************************************************* */

#define C1TDCL SFR8(0x010C) /* byte 0: TDCV[5:0]        */
#define C1TDCH SFR8(0x010D) /* byte 1: TDCO[6:0]        */
#define C1TDCU SFR8(0x010E) /* byte 2: TDCMOD, EDGFLTEN */
#define C1TDCT SFR8(0x010F) /* byte 3: SID11EN          */
#define C1TDC SFR32(0x010C) /* full 32-bit access       */

/* Bits 5:0 - TDCV[5:0]: Transmitter Delay Compensation Value (read-only)
 *   In auto mode, hardware measures the transmitter-to-receiver loop
 *   delay and stores it here.  Read to verify TDC operation.
 *   Range: 0-63 time quanta.                                           */
#define C1TDC_TDCV_POS 0
#define C1TDC_TDCV_MASK (0x3Fu << 0)

/* Bits 14:8 - TDCO[6:0]: Transmitter Delay Compensation Offset
 *   Manual offset added to the measured delay (auto mode) or used
 *   as the sole compensation value (manual mode).
 *   Range: 0-127 time quanta.                                          */
#define C1TDC_TDCO_POS 8
#define C1TDC_TDCO_MASK (0x7Fu << 8)

/* Bits 17:16 - TDCMOD[1:0]: TDC Mode
 *   Selects the transmitter delay compensation mode.
 *   Use CAN_TDCMOD_* constants.                                        */
#define C1TDC_TDCMOD_POS 16
#define C1TDC_TDCMOD_MASK (0x03u << 16)

/* Bit 19 - EDGFLTEN: Edge Filter Enable
 *   1 = Enable edge filtering on the CAN bus input during the
 *       data phase to reject glitches.
 *   0 = Edge filtering disabled.                                       */
#define C1TDC_EDGFLTEN (1u << 19)

/* Bit 24 - SID11EN: SID[11] Enable (CAN FD Base Format)
 *   1 = In CAN FD Base format frames, the SID11 bit (12th ID bit)
 *       is included in RX filter matching and stored in messages.
 *   0 = SID11 bit is ignored (standard 11-bit SID only).               */
#define C1TDC_SID11EN (1u << 24)

/* *********************************************************************
 *
 *  C1TBC - Time Base Counter
 *  Address: 0x0110 (32-bit)
 *
 *  32-bit free-running counter for CAN message timestamping.  The
 *  counter increments at a rate determined by C1TSCON.TBCPRE when
 *  enabled via C1TSCON.TBCEN.
 *
 * ********************************************************************* */

#define C1TBCL SFR8(0x0110) /* byte 0: TBC[7:0]         */
#define C1TBCH SFR8(0x0111) /* byte 1: TBC[15:8]        */
#define C1TBCU SFR8(0x0112) /* byte 2: TBC[23:16]       */
#define C1TBCT SFR8(0x0113) /* byte 3: TBC[31:24]       */
#define C1TBC SFR32(0x0110) /* full 32-bit access       */

/* *********************************************************************
 *
 *  C1TSCON - Timestamp Control
 *  Address: 0x0114 (32-bit)
 *
 *  Controls the time base counter prescaler, resolution, and enable.
 *
 * ********************************************************************* */

#define C1TSCONL SFR8(0x0114) /* byte 0: TBCPRE[7:0]      */
#define C1TSCONH SFR8(0x0115) /* byte 1: TBCPRE[9:8]      */
#define C1TSCONU SFR8(0x0116) /* byte 2: TSRES, TSEOF     */
#define C1TSCONT SFR8(0x0117) /* byte 3: TBCEN            */
#define C1TSCON SFR32(0x0114) /* full 32-bit access       */

/* Bits 9:0 - TBCPRE[9:0]: Time Base Counter Prescaler
 *   TBC increment rate = Fcan / (TBCPRE + 1).
 *   Range: 0-1023 (divides by 1-1024).                                 */
#define C1TSCON_TBCPRE_POS 0
#define C1TSCON_TBCPRE_MASK (0x03FFu << 0)

/* Bit 16 - TSRES: Timestamp Resolution
 *   1 = Timestamp captured at start of frame (SOF).
 *   0 = Timestamp captured at end of frame (EOF).                      */
#define C1TSCON_TSRES (1u << 16)

/* Bit 17 - TSEOF: Timestamp at EOF
 *   1 = End-of-frame timestamping (overrides TSRES interpretation
 *       depending on implementation).
 *   0 = Start-of-frame timestamping.
 *   Refer to DS40002213D for exact interaction with TSRES.             */
#define C1TSCON_TSEOF (1u << 17)

/* Bit 24 - TBCEN: Time Base Counter Enable
 *   1 = Time base counter is enabled and running.
 *   0 = Time base counter is stopped and held at its current value.    */
#define C1TSCON_TBCEN (1u << 24)

/* *********************************************************************
 *
 *  C1VEC - Interrupt Vector Register
 *  Address: 0x0118 (32-bit, read-only)
 *
 *  Reports the highest-priority pending interrupt source and the
 *  filter hit number for the most recently received message.  Used
 *  for vectored interrupt handling.
 *
 * ********************************************************************* */

#define C1VECL SFR8(0x0118) /* byte 0: ICODE[6:0]       */
#define C1VECH SFR8(0x0119) /* byte 1: FILHIT[4:0]      */
#define C1VECU SFR8(0x011A) /* byte 2: TXCODE[6:0]      */
#define C1VECT SFR8(0x011B) /* byte 3: RXCODE[6:0]      */
#define C1VEC SFR32(0x0118) /* full 32-bit access       */

/* Bits 6:0 - ICODE[6:0]: Interrupt Flag Code (read-only)
 *   Index of the highest-priority pending CAN interrupt source.
 *   0x00 = No interrupt, 0x01 = Error, 0x02 = Wake-up, etc.
 *   Refer to DS40002213D Table 29-X for complete encoding.             */
#define C1VEC_ICODE_POS 0
#define C1VEC_ICODE_MASK (0x7Fu << 0)

/* Bits 12:8 - FILHIT[4:0]: Filter Hit Number (read-only)
 *   Number of the acceptance filter that matched the most recently
 *   received message.  Range: 0-11.                                    */
#define C1VEC_FILHIT_POS 8
#define C1VEC_FILHIT_MASK (0x1Fu << 8)

/* Bits 22:16 - TXCODE[6:0]: TX Interrupt Flag Code (read-only)
 *   Index of the FIFO that caused the TX interrupt.                    */
#define C1VEC_TXCODE_POS 16
#define C1VEC_TXCODE_MASK (0x7Fu << 16)

/* Bits 30:24 - RXCODE[6:0]: RX Interrupt Flag Code (read-only)
 *   Index of the FIFO that caused the RX interrupt.                    */
#define C1VEC_RXCODE_POS 24
#define C1VEC_RXCODE_MASK (0x7Fu << 24)

