Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_can.h
/* *********************************************************************
 *
 *  C1INT - Interrupt Register
 *  Address: 0x011C (32-bit)
 *
 *  Combined interrupt flags (bytes 0 and 2) and interrupt enables
 *  (bytes 1 and 3) for the CAN module.
 *
 *  Byte 0: Basic interrupt flags (TXIF, RXIF)
 *  Byte 1: Basic interrupt enables (TXIE, RXIE)
 *  Byte 2: Event interrupt flags
 *  Byte 3: Event interrupt enables
 *
 * ********************************************************************* */

#define C1INTL SFR8(0x011C) /* byte 0: basic flags      */
#define C1INTH SFR8(0x011D) /* byte 1: basic enables    */
#define C1INTU SFR8(0x011E) /* byte 2: event flags      */
#define C1INTT SFR8(0x011F) /* byte 3: event enables    */
#define C1INT SFR32(0x011C) /* full 32-bit access       */

/* --- Byte 0 (C1INTL): Basic Interrupt Flags --- */

/* Bit 0 - TXIF: Transmit Interrupt Flag (read-only)
 *   1 = At least one TX FIFO is not full (ready to accept data).
 *   0 = All TX FIFOs are full.  Cleared automatically by hardware.     */
#define C1INT_TXIF (1u << 0)

/* Bit 1 - RXIF: Receive Interrupt Flag (read-only)
 *   1 = At least one RX FIFO contains a message (not empty).
 *   0 = All RX FIFOs are empty.  Cleared automatically by hardware.    */
#define C1INT_RXIF (1u << 1)

/* --- Byte 1 (C1INTH): Basic Interrupt Enables --- */

/* Bit 8 - TXIE: Transmit Interrupt Enable
 *   1 = Interrupt enabled when TXIF is set.
 *   0 = TX interrupt disabled.                                         */
#define C1INT_TXIE (1u << 8)

/* Bit 9 - RXIE: Receive Interrupt Enable
 *   1 = Interrupt enabled when RXIF is set.
 *   0 = RX interrupt disabled.                                         */
#define C1INT_RXIE (1u << 9)

/* --- Byte 2 (C1INTU): Event Interrupt Flags --- */

/* Bit 16 - TXATIF: TX Attempt Interrupt Flag (read-only)
 *   1 = A TX attempt limit was reached on one or more FIFOs.           */
#define C1INT_TXATIF (1u << 16)

/* Bit 17 - TEFIF: TX Event FIFO Interrupt Flag (read-only)
 *   1 = TX Event FIFO has a pending event (not empty, overflow, etc.)  */
#define C1INT_TEFIF (1u << 17)

/* Bit 19 - WAKIF: Bus Wake-up Interrupt Flag
 *   1 = CAN bus activity detected (wake-up from Sleep).
 *   Cleared by software.                                               */
#define C1INT_WAKIF (1u << 19)

/* Bit 20 - IVMIF: Invalid Message Interrupt Flag
 *   1 = An invalid message was received (format error detected).
 *   Cleared by software.                                               */
#define C1INT_IVMIF (1u << 20)

/* Bit 21 - SERRIF: System Error Interrupt Flag
 *   1 = A system error occurred (access violation, ECC error, etc.).
 *   Cleared by software.                                               */
#define C1INT_SERRIF (1u << 21)

/* Bit 22 - CERRIF: CAN Bus Error Interrupt Flag
 *   1 = A CAN bus error occurred (error counter threshold crossed).
 *   Cleared by software.                                               */
#define C1INT_CERRIF (1u << 22)

/* Bit 23 - TBCIF: Time Base Counter Interrupt Flag
 *   1 = Time base counter overflow or comparison match.
 *   Cleared by software.                                               */
#define C1INT_TBCIF (1u << 23)

/* Bit 24 - RXOVIF: Receive FIFO Overflow Interrupt Flag (read-only)
 *   1 = At least one RX FIFO has overflowed.                           */
#define C1INT_RXOVIF (1u << 24)

/* Bit 25 - MODIF: Mode Change Interrupt Flag
 *   1 = The operating mode has changed (OPMOD != previous value).
 *   Cleared by software.                                               */
#define C1INT_MODIF (1u << 25)

/* --- Byte 3 (C1INTT): Event Interrupt Enables --- */

/* Bit 16+8=24 mapping note: enables are in byte 3 (bits 31:24 of the
 * 32-bit register), mirroring the flag positions from byte 2.
 * The enable bit for flag at bit N in byte2 is at bit (N+8) here.      */

/* Bit 24 - TXATIE: TX Attempt Interrupt Enable                         */
#define C1INT_TXATIE (1u << 24)
#define C1INT_TXATIE_B3 (1u << 0) /* relative to byte 3 alone      */

/* Bit 25 - TEFIE: TX Event FIFO Interrupt Enable                      */
#define C1INT_TEFIE (1u << 25)
#define C1INT_TEFIE_B3 (1u << 1) /* relative to byte 3 alone      */

/* Bit 27 - WAKIE: Bus Wake-up Interrupt Enable                        */
#define C1INT_WAKIE (1u << 27)
#define C1INT_WAKIE_B3 (1u << 3) /* relative to byte 3 alone      */

/* Bit 28 - IVMIE: Invalid Message Interrupt Enable                    */
#define C1INT_IVMIE (1u << 28)
#define C1INT_IVMIE_B3 (1u << 4) /* relative to byte 3 alone      */

/* Bit 29 - SERRIE: System Error Interrupt Enable                      */
#define C1INT_SERRIE (1u << 29)
#define C1INT_SERRIE_B3 (1u << 5) /* relative to byte 3 alone      */

/* Bit 30 - CERRIE: CAN Bus Error Interrupt Enable                     */
#define C1INT_CERRIE (1u << 30)
#define C1INT_CERRIE_B3 (1u << 6) /* relative to byte 3 alone      */

/* Bit 31 - TBCIE: Time Base Counter Interrupt Enable                  */
#define C1INT_TBCIE (1u << 31)
#define C1INT_TBCIE_B3 (1u << 7) /* relative to byte 3 alone      */

/* Note: RXOVIE and MODIE also exist in byte 3 at their respective
 * positions.  The exact bit mapping within byte 3 should be verified
 * against DS40002213D Table 29-9 for the precise enable layout.        */

/* *********************************************************************
 *
 *  C1RXIF - Receive FIFO Interrupt Flags
 *  Address: 0x0120 (32-bit)
 *
 *  Per-FIFO receive interrupt flags.  Bit n corresponds to FIFO n.
 *
 * ********************************************************************* */

#define C1RXIFL SFR8(0x0120)
#define C1RXIFH SFR8(0x0121)
#define C1RXIFU SFR8(0x0122)
#define C1RXIFT SFR8(0x0123)
#define C1RXIF SFR32(0x0120)

#define C1RXIF_RFIF1 (1u << 1) /* FIFO 1 receive interrupt flag */
#define C1RXIF_RFIF2 (1u << 2) /* FIFO 2 receive interrupt flag */
#define C1RXIF_RFIF3 (1u << 3) /* FIFO 3 receive interrupt flag */

/* *********************************************************************
 *
 *  C1TXIF - Transmit FIFO Interrupt Flags
 *  Address: 0x0124 (32-bit)
 *
 *  Per-FIFO transmit interrupt flags.  Bit n corresponds to FIFO n.
 *  TXQ is represented as FIFO 0.
 *
 * ********************************************************************* */

#define C1TXIFL SFR8(0x0124)
#define C1TXIFH SFR8(0x0125)
#define C1TXIFU SFR8(0x0126)
#define C1TXIFT SFR8(0x0127)
#define C1TXIF SFR32(0x0124)

