Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_can.h
#define C1TXIF_TFIF0 (1u << 0) /* TXQ transmit interrupt flag   */
#define C1TXIF_TFIF1 (1u << 1) /* FIFO 1 transmit interrupt flag*/
#define C1TXIF_TFIF2 (1u << 2) /* FIFO 2 transmit interrupt flag*/
#define C1TXIF_TFIF3 (1u << 3) /* FIFO 3 transmit interrupt flag*/

/* *********************************************************************
 *
 *  C1RXOVIF - Receive Overflow Interrupt Flags
 *  Address: 0x0128 (32-bit)
 *
 *  Per-FIFO receive overflow flags.
 *
 * ********************************************************************* */

#define C1RXOVIFL SFR8(0x0128)
#define C1RXOVIFH SFR8(0x0129)
#define C1RXOVIFU SFR8(0x012A)
#define C1RXOVIFT SFR8(0x012B)
#define C1RXOVIF SFR32(0x0128)

#define C1RXOVIF_RFOVIF1 (1u << 1) /* FIFO 1 overflow flag          */
#define C1RXOVIF_RFOVIF2 (1u << 2) /* FIFO 2 overflow flag          */
#define C1RXOVIF_RFOVIF3 (1u << 3) /* FIFO 3 overflow flag          */

/* *********************************************************************
 *
 *  C1TXATIF - Transmit Attempt Interrupt Flags
 *  Address: 0x012C (32-bit)
 *
 *  Per-FIFO transmit attempt limit flags (set when RTXAT enabled
 *  and the configured number of retries has been exhausted).
 *
 * ********************************************************************* */

#define C1TXATIFL SFR8(0x012C)
#define C1TXATIFH SFR8(0x012D)
#define C1TXATIFU SFR8(0x012E)
#define C1TXATIFT SFR8(0x012F)
#define C1TXATIF SFR32(0x012C)

#define C1TXATIF_TFATIF0 (1u << 0) /* TXQ attempt flag              */
#define C1TXATIF_TFATIF1 (1u << 1) /* FIFO 1 attempt flag           */
#define C1TXATIF_TFATIF2 (1u << 2) /* FIFO 2 attempt flag           */
#define C1TXATIF_TFATIF3 (1u << 3) /* FIFO 3 attempt flag           */

/* *********************************************************************
 *
 *  C1TXREQ - Transmit Request Register
 *  Address: 0x0130 (32-bit)
 *
 *  Per-FIFO transmit request bits.  Set by hardware when a FIFO has
 *  a message pending for transmission.
 *
 * ********************************************************************* */

#define C1TXREQL SFR8(0x0130)
#define C1TXREQH SFR8(0x0131)
#define C1TXREQU SFR8(0x0132)
#define C1TXREQT SFR8(0x0133)
#define C1TXREQ SFR32(0x0130)

#define C1TXREQ_TXREQ0 (1u << 0) /* TXQ has pending message       */
#define C1TXREQ_TXREQ1 (1u << 1) /* FIFO 1 has pending message    */
#define C1TXREQ_TXREQ2 (1u << 2) /* FIFO 2 has pending message    */
#define C1TXREQ_TXREQ3 (1u << 3) /* FIFO 3 has pending message    */

/* *********************************************************************
 *
 *  C1TREC - Transmit/Receive Error Count
 *  Address: 0x0134 (32-bit)
 *
 *  Contains the CAN error counters and bus-off / error-passive status.
 *
 * ********************************************************************* */

#define C1TRECL SFR8(0x0134) /* byte 0: RERRCNT[7:0]     */
#define C1TRECH SFR8(0x0135) /* byte 1: TERRCNT[7:0]     */
#define C1TRECU SFR8(0x0136) /* byte 2: status bits      */
#define C1TRECT SFR8(0x0137) /* byte 3: reserved         */
#define C1TREC SFR32(0x0134) /* full 32-bit access       */

/* Bits 7:0 - RERRCNT[7:0]: Receive Error Counter
 *   Current value of the CAN receive error counter (REC).
 *   Read-only.  Range: 0-255.                                          */
#define C1TREC_RERRCNT_POS 0
#define C1TREC_RERRCNT_MASK (0xFFu << 0)

/* Bits 15:8 - TERRCNT[7:0]: Transmit Error Counter
 *   Current value of the CAN transmit error counter (TEC).
 *   Read-only.  Range: 0-255.                                          */
#define C1TREC_TERRCNT_POS 8
#define C1TREC_TERRCNT_MASK (0xFFu << 8)

/* Bit 16 - EWARN: Error Warning Flag (read-only)
 *   1 = TEC or REC >= 96.                                              */
#define C1TREC_EWARN (1u << 16)

/* Bit 17 - RXWARN: Receive Error Warning (read-only)
 *   1 = REC >= 96.                                                     */
#define C1TREC_RXWARN (1u << 17)

/* Bit 18 - TXWARN: Transmit Error Warning (read-only)
 *   1 = TEC >= 96.                                                     */
#define C1TREC_TXWARN (1u << 18)

/* Bit 19 - RXBP: Receive Bus Passive (read-only)
 *   1 = REC >= 128 (error passive state for receiver).                 */
#define C1TREC_RXBP (1u << 19)

/* Bit 20 - TXBP: Transmit Bus Passive (read-only)
 *   1 = TEC >= 128 (error passive state for transmitter).              */
#define C1TREC_TXBP (1u << 20)

/* Bit 21 - TXBO: Transmit Bus Off (read-only)
 *   1 = TEC >= 256 (bus-off state).  The module will not transmit
 *       or receive until a bus-off recovery sequence completes.        */
#define C1TREC_TXBO (1u << 21)

/* *********************************************************************
 *
 *  C1BDIAG0 - Bus Diagnostic Register 0
 *  Address: 0x0138 (32-bit)
 *
 *  Contains separate error counters for nominal and data bit rate
 *  phases.  These counters are independent of the protocol error
 *  counters in C1TREC and can be cleared by writing.
 *
 * ********************************************************************* */

#define C1BDIAG0L SFR8(0x0138) /* byte 0: NRERRCNT[7:0]    */
#define C1BDIAG0H SFR8(0x0139) /* byte 1: NTERRCNT[7:0]    */
#define C1BDIAG0U SFR8(0x013A) /* byte 2: DRERRCNT[7:0]    */
#define C1BDIAG0T SFR8(0x013B) /* byte 3: DTERRCNT[7:0]    */
#define C1BDIAG0 SFR32(0x0138) /* full 32-bit access       */

/* Bits  7:0  - NRERRCNT[7:0]: Nominal Bit Rate Receive Error Count     */
#define C1BDIAG0_NRERRCNT_POS 0
#define C1BDIAG0_NRERRCNT_MASK (0xFFu << 0)

/* Bits 15:8  - NTERRCNT[7:0]: Nominal Bit Rate Transmit Error Count    */
#define C1BDIAG0_NTERRCNT_POS 8
#define C1BDIAG0_NTERRCNT_MASK (0xFFu << 8)

/* Bits 23:16 - DRERRCNT[7:0]: Data Bit Rate Receive Error Count        */
#define C1BDIAG0_DRERRCNT_POS 16
#define C1BDIAG0_DRERRCNT_MASK (0xFFu << 16)

/* Bits 31:24 - DTERRCNT[7:0]: Data Bit Rate Transmit Error Count       */
#define C1BDIAG0_DTERRCNT_POS 24
#define C1BDIAG0_DTERRCNT_MASK (0xFFu << 24)

/* *********************************************************************
 *
 *  C1BDIAG1 - Bus Diagnostic Register 1
 *  Address: 0x013C (32-bit)
 *
 *  Error type flags for both nominal and data bit rate phases.
 *  Each flag is set by hardware on the corresponding error type.
 *  Cleared by writing 0.
 *
 * ********************************************************************* */

#define C1BDIAG1L SFR8(0x013C) /* byte 0: nominal errors   */
#define C1BDIAG1H SFR8(0x013D) /* byte 1: nominal + data   */
#define C1BDIAG1U SFR8(0x013E) /* byte 2: data errors      */
#define C1BDIAG1T SFR8(0x013F) /* byte 3: misc error bits  */
#define C1BDIAG1 SFR32(0x013C) /* full 32-bit access       */

/* --- Nominal bit rate error flags --- */
#define C1BDIAG1_NBIT0ERR (1u << 0) /* Nominal bit 0 error           */
#define C1BDIAG1_NBIT1ERR (1u << 1) /* Nominal bit 1 error           */
#define C1BDIAG1_NACKERR (1u << 2)  /* Nominal ACK error             */
#define C1BDIAG1_NFORMERR (1u << 3) /* Nominal form error            */
#define C1BDIAG1_NSTUFERR (1u << 4) /* Nominal stuff error           */
#define C1BDIAG1_NCRCERR (1u << 5)  /* Nominal CRC error             */

/* --- Data bit rate error flags --- */
#define C1BDIAG1_DBIT0ERR (1u << 8)  /* Data bit 0 error              */
#define C1BDIAG1_DBIT1ERR (1u << 9)  /* Data bit 1 error              */
#define C1BDIAG1_DFORMERR (1u << 10) /* Data form error               */
#define C1BDIAG1_DSTUFERR (1u << 11) /* Data stuff error              */
#define C1BDIAG1_DCRCERR (1u << 12)  /* Data CRC error                */

/* --- Miscellaneous error flags --- */
#define C1BDIAG1_ESI (1u << 16)     /* ESI flag of received FD frame */
#define C1BDIAG1_DLCMM (1u << 17)   /* DLC mismatch                  */
#define C1BDIAG1_TXBOERR (1u << 24) /* Device went bus-off           */

