Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_can.h
/* *********************************************************************
 *
 *  C1TEFCON - TX Event FIFO Control
 *  Address: 0x0140 (32-bit)
 *
 *  Controls the Transmit Event FIFO (TEF), which stores records of
 *  successfully transmitted messages including timestamps.  The TEF
 *  must be enabled via C1CON.STEF = 1 for records to be stored.
 *
 * ********************************************************************* */

#define C1TEFCONL SFR8(0x0140) /* byte 0: enables/sizes    */
#define C1TEFCONH SFR8(0x0141) /* byte 1: FSIZE            */
#define C1TEFCONU SFR8(0x0142) /* byte 2: reserved         */
#define C1TEFCONT SFR8(0x0143) /* byte 3: UINC, FRESET     */
#define C1TEFCON SFR32(0x0140) /* full 32-bit access       */

/* Bit 0 - TEFFIE: TEF Full Interrupt Enable
 *   1 = Interrupt when the TEF is completely full.                     */
#define C1TEFCON_TEFFIE (1u << 0)

/* Bit 1 - TEFNEIE: TEF Not Empty Interrupt Enable
 *   1 = Interrupt when TEF transitions from empty to not-empty.        */
#define C1TEFCON_TEFNEIE (1u << 1)

/* Bit 2 - TEFHIE: TEF Half Full Interrupt Enable
 *   1 = Interrupt when TEF reaches half-full threshold.                */
#define C1TEFCON_TEFHIE (1u << 2)

/* Bit 3 - TEFOVIE: TEF Overflow Interrupt Enable
 *   1 = Interrupt on TEF overflow (message lost because TEF full).     */
#define C1TEFCON_TEFOVIE (1u << 3)

/* Bit 5 - TEFTSEN: TEF Timestamp Enable
 *   1 = Timestamps are stored with each TEF entry.
 *   0 = No timestamps in TEF entries (saves RAM space).                */
#define C1TEFCON_TEFTSEN (1u << 5)

/* Bits 12:8 - FSIZE[4:0]: FIFO Size
 *   Number of TEF entries = FSIZE + 1.
 *   Range: 0-31 (1-32 entries).                                        */
#define C1TEFCON_FSIZE_POS 8
#define C1TEFCON_FSIZE_MASK (0x1Fu << 8)

/* Bit 24 - UINC: User Increment (write-only, self-clearing)
 *   Write 1 = Advance the TEF read pointer by one entry.
 *   Read always returns 0.  Used after reading a TEF entry to move
 *   to the next entry in the FIFO.                                     */
#define C1TEFCON_UINC (1u << 24)

/* Bit 25 - FRESET: FIFO Reset (write-only, self-clearing)
 *   Write 1 = Reset the TEF head and tail pointers.  All entries
 *   are discarded.  Hardware clears this bit when the reset completes. */
#define C1TEFCON_FRESET (1u << 25)

/* *********************************************************************
 *
 *  C1TEFSTA - TX Event FIFO Status
 *  Address: 0x0144 (32-bit)
 *
 * ********************************************************************* */

#define C1TEFSTAL SFR8(0x0144) /* byte 0: status flags     */
#define C1TEFSTAH SFR8(0x0145) /* byte 1: reserved         */
#define C1TEFSTAU SFR8(0x0146) /* byte 2: reserved         */
#define C1TEFSTAT SFR8(0x0147) /* byte 3: reserved         */
#define C1TEFSTA SFR32(0x0144) /* full 32-bit access       */

/* Bit 0 - TEFFIF: TEF Full Interrupt Flag (read-only)
 *   1 = TEF is completely full.                                        */
#define C1TEFSTA_TEFFIF (1u << 0)

/* Bit 1 - TEFNEIF: TEF Not Empty Interrupt Flag (read-only)
 *   1 = TEF contains at least one unread entry.                        */
#define C1TEFSTA_TEFNEIF (1u << 1)

/* Bit 2 - TEFHIF: TEF Half Full Interrupt Flag (read-only)
 *   1 = TEF is at least half full.                                     */
#define C1TEFSTA_TEFHIF (1u << 2)

/* Bit 3 - TEFOVIF: TEF Overflow Interrupt Flag
 *   1 = TEF has overflowed (a TX event was lost).
 *   Cleared by software writing 0.                                     */
#define C1TEFSTA_TEFOVIF (1u << 3)

/* *********************************************************************
 *
 *  C1TEFUA - TX Event FIFO User Address
 *  Address: 0x0148 (32-bit)
 *
 *  Read-only.  Points to the address of the next TEF entry to be
 *  read in the CAN message RAM.
 *
 * ********************************************************************* */

#define C1TEFUAL SFR8(0x0148)
#define C1TEFUAH SFR8(0x0149)
#define C1TEFUAU SFR8(0x014A)
#define C1TEFUAT SFR8(0x014B)
#define C1TEFUA SFR32(0x0148)

/* *********************************************************************
 *
 *  C1FIFOBA - FIFO Base Address
 *  Address: 0x014C (32-bit)
 *
 *  Starting address of the CAN FIFO region in the CAN message RAM.
 *  All FIFO user-address pointers are relative to the address space
 *  beginning at this value.
 *
 * ********************************************************************* */

#define C1FIFOBAL SFR8(0x014C)
#define C1FIFOBAH SFR8(0x014D)
#define C1FIFOBAU SFR8(0x014E)
#define C1FIFOBAT SFR8(0x014F)
#define C1FIFOBA SFR32(0x014C)

/* *********************************************************************
 *
 *  C1TXQCON - TX Queue Control Register
 *  Address: 0x0150 (32-bit)
 *
 *  Controls the dedicated Transmit Queue (TXQ), which is a priority-
 *  based transmit FIFO.  Messages in the TXQ are transmitted in
 *  priority order (lowest CAN ID first).
 *
 * ********************************************************************* */

#define C1TXQCONL SFR8(0x0150) /* byte 0                   */
#define C1TXQCONH SFR8(0x0151) /* byte 1                   */
#define C1TXQCONU SFR8(0x0152) /* byte 2                   */
#define C1TXQCONT SFR8(0x0153) /* byte 3                   */
#define C1TXQCON SFR32(0x0150) /* full 32-bit access       */

/* Bit 0 - TXQNIE: TX Queue Not Full Interrupt Enable
 *   1 = Interrupt when TXQ transitions from full to not-full.          */
#define C1TXQCON_TXQNIE (1u << 0)

/* Bit 1 - TXQEIE: TX Queue Empty Interrupt Enable
 *   1 = Interrupt when TXQ becomes completely empty.                   */
#define C1TXQCON_TXQEIE (1u << 1)

/* Bits 4:3 - TXAT[1:0]: TX Attempts
 *   Controls retry behaviour.  Use CAN_TXAT_* constants.
 *   Only effective when C1CON.RTXAT = 1.                               */
#define C1TXQCON_TXAT_POS 3
#define C1TXQCON_TXAT_MASK (0x03u << 3)

/* Bit 5 - TXATIE: TX Attempts Exhausted Interrupt Enable
 *   1 = Interrupt when TX attempt limit is reached.                    */
#define C1TXQCON_TXATIE (1u << 5)

