Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_can.h
/* Bit 7 - TXEN: Transmit Enable
 *   1 = TXQ is enabled for transmitting.
 *   0 = TXQ is disabled (no messages sent from TXQ).                   */
#define C1TXQCON_TXEN (1u << 7)

/* Bits 12:8 - FSIZE[4:0]: FIFO Size
 *   Number of messages in TXQ = FSIZE + 1.
 *   Range: 0-31 (1-32 messages).                                       */
#define C1TXQCON_FSIZE_POS 8
#define C1TXQCON_FSIZE_MASK (0x1Fu << 8)

/* Bits 18:16 - PLSIZE[2:0]: Payload Size
 *   Use CAN_PLSIZE_* constants.                                        */
#define C1TXQCON_PLSIZE_POS 16
#define C1TXQCON_PLSIZE_MASK (0x07u << 16)

/* Bits 28:24 - TXPRI[4:0]: TX Priority
 *   Arbitration priority for this FIFO relative to other TX FIFOs.
 *   Lower values = higher priority (transmitted first).
 *   Range: 0-31.                                                       */
#define C1TXQCON_TXPRI_POS 24
#define C1TXQCON_TXPRI_MASK (0x1Fu << 24)

/* Bit 29 - FRESET: FIFO Reset (write-only, self-clearing)
 *   Write 1 = Reset TXQ FIFO pointers.                                */
#define C1TXQCON_FRESET (1u << 29)

/* Bit 30 - UINC: User Increment (write-only, self-clearing)
 *   Write 1 = Advance TXQ write pointer to next slot after writing
 *   a message object.                                                  */
#define C1TXQCON_UINC (1u << 30)

/* *********************************************************************
 *
 *  C1TXQSTA - TX Queue Status Register
 *  Address: 0x0154 (32-bit)
 *
 * ********************************************************************* */

#define C1TXQSTAL SFR8(0x0154) /* byte 0: status flags     */
#define C1TXQSTAH SFR8(0x0155) /* byte 1: TXQCI            */
#define C1TXQSTAU SFR8(0x0156) /* byte 2: reserved         */
#define C1TXQSTAT SFR8(0x0157) /* byte 3: reserved         */
#define C1TXQSTA SFR32(0x0154) /* full 32-bit access       */

/* Bit 0 - TXQNIF: TX Queue Not Full Interrupt Flag (read-only)
 *   1 = TXQ is not full; space available for new messages.             */
#define C1TXQSTA_TXQNIF (1u << 0)

/* Bit 1 - TXQEIF: TX Queue Empty Interrupt Flag (read-only)
 *   1 = TXQ is empty; no messages pending for transmission.            */
#define C1TXQSTA_TXQEIF (1u << 1)

/* Bit 4 - TXREQ: TX Request Pending (read-only)
 *   1 = TXQ has at least one message pending for transmission.
 *   0 = No pending transmissions in TXQ.                               */
#define C1TXQSTA_TXREQ (1u << 4)

/* Bit 5 - TXERR: TX Error (read-only)
 *   1 = A bus error occurred during the last transmission attempt.     */
#define C1TXQSTA_TXERR (1u << 5)

/* Bit 6 - TXLARB: TX Lost Arbitration (read-only)
 *   1 = The last transmission lost arbitration.                        */
#define C1TXQSTA_TXLARB (1u << 6)

/* Bit 7 - TXABT: TX Aborted (read-only)
 *   1 = The last transmission was aborted (by ABAT or attempt limit). */
#define C1TXQSTA_TXABT (1u << 7)

/* Bits 12:8 - TXQCI[4:0]: TX Queue Index (read-only)
 *   Points to the next message slot to be read by the CAN module
 *   for transmission.                                                  */
#define C1TXQSTA_TXQCI_POS 8
#define C1TXQSTA_TXQCI_MASK (0x1Fu << 8)

/* *********************************************************************
 *
 *  C1TXQUA - TX Queue User Address
 *  Address: 0x0158 (32-bit)
 *
 *  Read-only.  Points to the next available slot in the TXQ where
 *  the application should write the message object to be transmitted.
 *
 * ********************************************************************* */

#define C1TXQUAL SFR8(0x0158)
#define C1TXQUAH SFR8(0x0159)
#define C1TXQUAU SFR8(0x015A)
#define C1TXQUAT SFR8(0x015B)
#define C1TXQUA SFR32(0x0158)

/* *********************************************************************
 *
 *  C1FIFOCONn - FIFO Control Registers (n = 1, 2, 3)
 *
 *  Each of the three programmable FIFOs has an identical control
 *  register layout.  A FIFO can be configured as either TX or RX
 *  by setting/clearing the TXEN bit.
 *
 * ********************************************************************* */

/* --- FIFO 1 Control: C1FIFOCON1 @ 0x015C --- */

#define C1FIFOCON1L SFR8(0x015C)
#define C1FIFOCON1H SFR8(0x015D)
#define C1FIFOCON1U SFR8(0x015E)
#define C1FIFOCON1T SFR8(0x015F)
#define C1FIFOCON1 SFR32(0x015C)

/* --- FIFO 2 Control: C1FIFOCON2 @ 0x0168 --- */

#define C1FIFOCON2L SFR8(0x0168)
#define C1FIFOCON2H SFR8(0x0169)
#define C1FIFOCON2U SFR8(0x016A)
#define C1FIFOCON2T SFR8(0x016B)
#define C1FIFOCON2 SFR32(0x0168)

/* --- FIFO 3 Control: C1FIFOCON3 @ 0x0174 --- */

#define C1FIFOCON3L SFR8(0x0174)
#define C1FIFOCON3H SFR8(0x0175)
#define C1FIFOCON3U SFR8(0x0176)
#define C1FIFOCON3T SFR8(0x0177)
#define C1FIFOCON3 SFR32(0x0174)

/* --- Shared FIFOCONn bit definitions ---
 *
 * These bit masks/positions apply identically to C1FIFOCON1, C1FIFOCON2,
 * and C1FIFOCON3.  OR them into any C1FIFOCONn register.
 *
 * Byte 0 layout:
 *   Bit 0 - TFNRFNIE: FIFO Not Full (TX) / Not Empty (RX) Interrupt Enable
 *   Bit 1 - TFHRFHIE: FIFO Half Full Interrupt Enable
 *   Bit 2 - TFERFFIE: FIFO Full (TX) / Full (RX) Interrupt Enable
 *   Bit 3 - RXOVIE:   Receive Overflow Interrupt Enable (RX FIFOs only)
 *   Bit 4 - TXATIE:   TX Attempt Interrupt Enable (TX FIFOs only)
 *   Bits 6:5 - TXAT[1:0]: TX Attempts (use CAN_TXAT_* constants)
 *   Bit 7 - TXEN:     FIFO Direction (1=TX, 0=RX)
 *
 * Byte 1 layout:
 *   Bit 8 - RTREN:    Auto RTR Enable (respond to remote frames)
 *   Bit 9 - RXTSEN:   RX Timestamp Enable
 *   Bit 10 - TXABT:   (read in FIFOSTAn, but reserved in FIFOCONn)
 *   Bits 15:11 - reserved
 *
 * Byte 2 layout:
 *   Bits 20:16 - FSIZE[4:0]: FIFO Depth (messages = FSIZE+1)
 *   Bits 23:21 - PLSIZE[2:0]: Payload Size (use CAN_PLSIZE_*)
 *
 * Byte 3 layout:
 *   Bits 28:24 - TXPRI[4:0]: TX Priority (TX FIFOs only)
 *   Bit 29 - TXREQ:   TX Request (write 1 to initiate TX, TX FIFO only)
 *   Bit 30 - UINC:    User Increment (write-only, self-clearing)
 *   Bit 31 - FRESET:  FIFO Reset (write-only, self-clearing)
 */

/* Byte 0 bits */
#define C1FIFOCON_TFNRFNIE (1u << 0) /* Not-full/not-empty int en     */
#define C1FIFOCON_TFHRFHIE (1u << 1) /* Half-full int en              */
#define C1FIFOCON_TFERFFIE (1u << 2) /* Full int en                   */
#define C1FIFOCON_RXOVIE (1u << 3)   /* RX overflow int en            */
#define C1FIFOCON_TXATIE (1u << 4)   /* TX attempt int en             */
#define C1FIFOCON_TXAT_POS 5
#define C1FIFOCON_TXAT_MASK (0x03u << 5)
#define C1FIFOCON_TXEN (1u << 7) /* 1=TX FIFO, 0=RX FIFO         */

/* Byte 1 bits */
#define C1FIFOCON_RTREN (1u << 8)  /* Auto RTR enable               */
#define C1FIFOCON_RXTSEN (1u << 9) /* RX timestamp enable           */

