Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_can.h
/* Byte 2 bits */
#define C1FIFOCON_FSIZE_POS 16
#define C1FIFOCON_FSIZE_MASK (0x1Fu << 16)
#define C1FIFOCON_PLSIZE_POS 21
#define C1FIFOCON_PLSIZE_MASK (0x07u << 21)

/* Byte 3 bits */
#define C1FIFOCON_TXPRI_POS 24
#define C1FIFOCON_TXPRI_MASK (0x1Fu << 24)
#define C1FIFOCON_TXREQ (1u << 29)  /* TX request (TX FIFOs)    */
#define C1FIFOCON_UINC (1u << 30)   /* User increment (w/o)     */
#define C1FIFOCON_FRESET (1u << 31) /* FIFO reset (w/o)         */

/* *********************************************************************
 *
 *  C1FIFOSTAn - FIFO Status Registers (n = 1, 2, 3)
 *
 * ********************************************************************* */

/* --- FIFO 1 Status: C1FIFOSTA1 @ 0x0160 --- */

#define C1FIFOSTA1L SFR8(0x0160)
#define C1FIFOSTA1H SFR8(0x0161)
#define C1FIFOSTA1U SFR8(0x0162)
#define C1FIFOSTA1T SFR8(0x0163)
#define C1FIFOSTA1 SFR32(0x0160)

/* --- FIFO 2 Status: C1FIFOSTA2 @ 0x016C --- */

#define C1FIFOSTA2L SFR8(0x016C)
#define C1FIFOSTA2H SFR8(0x016D)
#define C1FIFOSTA2U SFR8(0x016E)
#define C1FIFOSTA2T SFR8(0x016F)
#define C1FIFOSTA2 SFR32(0x016C)

/* --- FIFO 3 Status: C1FIFOSTA3 @ 0x0178 --- */

#define C1FIFOSTA3L SFR8(0x0178)
#define C1FIFOSTA3H SFR8(0x0179)
#define C1FIFOSTA3U SFR8(0x017A)
#define C1FIFOSTA3T SFR8(0x017B)
#define C1FIFOSTA3 SFR32(0x0178)

/* --- Shared FIFOSTAn bit definitions ---
 *
 * Byte 0:
 *   Bit 0 - TFNRFNIF: Not-Full (TX) / Not-Empty (RX) Interrupt Flag
 *   Bit 1 - TFHRFHIF: Half-Full Interrupt Flag
 *   Bit 2 - TFERFFIF: Full Interrupt Flag
 *   Bit 3 - RXOVIF:   RX Overflow Interrupt Flag (cleared by sw)
 *   Bit 4 - TXATIF:   TX Attempt Interrupt Flag (cleared by sw)
 *   Bit 5 - TXERR:    TX Error (read-only)
 *   Bit 6 - TXLARB:   TX Lost Arbitration (read-only)
 *   Bit 7 - TXABT:    TX Aborted (read-only)
 *
 * Byte 1:
 *   Bits 12:8 - FIFOCI[4:0]: FIFO Message Index (read-only)
 */

#define C1FIFOSTA_TFNRFNIF (1u << 0) /* Not-full / not-empty flag     */
#define C1FIFOSTA_TFHRFHIF (1u << 1) /* Half-full flag                */
#define C1FIFOSTA_TFERFFIF (1u << 2) /* Full flag                     */
#define C1FIFOSTA_RXOVIF (1u << 3)   /* RX overflow flag              */
#define C1FIFOSTA_TXATIF (1u << 4)   /* TX attempt flag               */
#define C1FIFOSTA_TXERR (1u << 5)    /* TX error (read-only)          */
#define C1FIFOSTA_TXLARB (1u << 6)   /* TX lost arbitration (r/o)     */
#define C1FIFOSTA_TXABT (1u << 7)    /* TX aborted (read-only)        */

#define C1FIFOSTA_FIFOCI_POS 8
#define C1FIFOSTA_FIFOCI_MASK (0x1Fu << 8)

/* *********************************************************************
 *
 *  C1FIFOUAn - FIFO User Address Registers (n = 1, 2, 3)
 *
 *  Read-only.  For TX FIFOs, points to the next slot to write a
 *  message object.  For RX FIFOs, points to the next message to read.
 *
 * ********************************************************************* */

/* --- FIFO 1 User Address: C1FIFOUA1 @ 0x0164 --- */

#define C1FIFOUA1L SFR8(0x0164)
#define C1FIFOUA1H SFR8(0x0165)
#define C1FIFOUA1U SFR8(0x0166)
#define C1FIFOUA1T SFR8(0x0167)
#define C1FIFOUA1 SFR32(0x0164)

/* --- FIFO 2 User Address: C1FIFOUA2 @ 0x0170 --- */

#define C1FIFOUA2L SFR8(0x0170)
#define C1FIFOUA2H SFR8(0x0171)
#define C1FIFOUA2U SFR8(0x0172)
#define C1FIFOUA2T SFR8(0x0173)
#define C1FIFOUA2 SFR32(0x0170)

/* --- FIFO 3 User Address: C1FIFOUA3 @ 0x017C --- */

#define C1FIFOUA3L SFR8(0x017C)
#define C1FIFOUA3H SFR8(0x017D)
#define C1FIFOUA3U SFR8(0x017E)
#define C1FIFOUA3T SFR8(0x017F)
#define C1FIFOUA3 SFR32(0x017C)

/* *********************************************************************
 *
 *  C1FLTCONn - Filter Control Registers (n = 0, 1, 2)
 *
 *  Each 32-bit register controls four acceptance filters.  Per-filter
 *  fields are packed into 8-bit lanes:
 *
 *  C1FLTCON0 (0x0180): filters 0-3
 *    Byte 0: FLTEN0 (bit7), F0BP[4:0] (bits 4:0)  -> filter 0
 *    Byte 1: FLTEN1 (bit7), F1BP[4:0] (bits 4:0)  -> filter 1
 *    Byte 2: FLTEN2 (bit7), F2BP[4:0] (bits 4:0)  -> filter 2
 *    Byte 3: FLTEN3 (bit7), F3BP[4:0] (bits 4:0)  -> filter 3
 *
 *  C1FLTCON1 (0x0184): filters 4-7
 *  C1FLTCON2 (0x0188): filters 8-11
 *
 *  FLTENn: Filter Enable (1=enabled, 0=disabled)
 *  FnBP[4:0]: Filter Buffer Pointer - selects which FIFO receives
 *             messages matching this filter.  0=TXQ (unusual), 1-3=FIFO1-3.
 *
 * ********************************************************************* */

#define C1FLTCON0L SFR8(0x0180) /* filter 0 control         */
#define C1FLTCON0H SFR8(0x0181) /* filter 1 control         */
#define C1FLTCON0U SFR8(0x0182) /* filter 2 control         */
#define C1FLTCON0T SFR8(0x0183) /* filter 3 control         */
#define C1FLTCON0 SFR32(0x0180)

#define C1FLTCON1L SFR8(0x0184) /* filter 4 control         */
#define C1FLTCON1H SFR8(0x0185) /* filter 5 control         */
#define C1FLTCON1U SFR8(0x0186) /* filter 6 control         */
#define C1FLTCON1T SFR8(0x0187) /* filter 7 control         */
#define C1FLTCON1 SFR32(0x0184)

#define C1FLTCON2L SFR8(0x0188) /* filter 8 control         */
#define C1FLTCON2H SFR8(0x0189) /* filter 9 control         */
#define C1FLTCON2U SFR8(0x018A) /* filter 10 control        */
#define C1FLTCON2T SFR8(0x018B) /* filter 11 control        */
#define C1FLTCON2 SFR32(0x0188)

/* Per-filter bit masks (apply to the individual byte for that filter)  */
#define C1FLTCON_FLTEN (1u << 7) /* Filter enable bit        */
#define C1FLTCON_FBP_POS 0       /* Buffer pointer position  */
#define C1FLTCON_FBP_MASK 0x1Fu  /* Buffer pointer mask      */

/* Convenience: per-filter enable bits within the 32-bit register       */
#define C1FLTCON_FLTEN0 (1u << 7)  /* byte 0, bit 7            */
#define C1FLTCON_FLTEN1 (1u << 15) /* byte 1, bit 7            */
#define C1FLTCON_FLTEN2 (1u << 23) /* byte 2, bit 7            */
#define C1FLTCON_FLTEN3 (1u << 31) /* byte 3, bit 7            */

/* Convenience: buffer pointer positions within the 32-bit register     */
#define C1FLTCON_F0BP_POS 0  /* filter 0 BP in bits 4:0  */
#define C1FLTCON_F1BP_POS 8  /* filter 1 BP in bits 12:8 */
#define C1FLTCON_F2BP_POS 16 /* filter 2 BP in bits 20:16*/
#define C1FLTCON_F3BP_POS 24 /* filter 3 BP in bits 28:24*/

/* Address 0x018C is reserved (gap before filter objects)               */

