Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_can.h
/* *********************************************************************
 *
 *  C1FLTOBJn / C1MASKn - Filter Object and Mask Registers
 *
 *  12 filter/mask pairs for CAN message acceptance filtering.
 *  Each filter object and mask is a 32-bit register with this layout:
 *
 *  Filter Object (C1FLTOBJn):
 *    Bits  10:0  - SID[10:0]:  Standard Identifier bits to match
 *    Bits  28:11 - EID[17:0]:  Extended Identifier bits to match
 *    Bit   29    - SID11:      12th SID bit (CAN FD base format)
 *    Bit   30    - EXIDE:      Extended ID Filter Enable
 *                               1 = Match extended frames (29-bit ID)
 *                               0 = Match standard frames (11-bit ID)
 *
 *  Mask Register (C1MASKn):
 *    Bits  10:0  - MSID[10:0]: SID mask (1=must match, 0=don't care)
 *    Bits  28:11 - MEID[17:0]: EID mask (1=must match, 0=don't care)
 *    Bit   29    - MSID11:     SID11 mask bit
 *    Bit   30    - MIDE:       Identifier type mask
 *                               1 = EXIDE bit must match for acceptance
 *                               0 = Match both standard and extended
 *
 * ********************************************************************* */

/* Shared bit positions for all filter object and mask registers        */
#define C1FLTOBJ_SID_POS 0
#define C1FLTOBJ_SID_MASK (0x07FFu << 0) /* SID[10:0]            */
#define C1FLTOBJ_EID_POS 11
#define C1FLTOBJ_EID_MASK (0x3FFFFu << 11) /* EID[17:0]            */
#define C1FLTOBJ_SID11 (1u << 29)          /* SID11 bit            */
#define C1FLTOBJ_EXIDE (1u << 30)          /* Extended ID enable   */

#define C1MASK_MSID_POS 0
#define C1MASK_MSID_MASK (0x07FFu << 0) /* MSID[10:0]          */
#define C1MASK_MEID_POS 11
#define C1MASK_MEID_MASK (0x3FFFFu << 11) /* MEID[17:0]          */
#define C1MASK_MSID11 (1u << 29)          /* MSID11 mask         */
#define C1MASK_MIDE (1u << 30)            /* ID type mask enable */

/* --- Filter 0 --- */
#define C1FLTOBJ0L SFR8(0x018C)
#define C1FLTOBJ0H SFR8(0x018D)
#define C1FLTOBJ0U SFR8(0x018E)
#define C1FLTOBJ0T SFR8(0x018F)
#define C1FLTOBJ0 SFR32(0x018C)

#define C1MASK0L SFR8(0x0190)
#define C1MASK0H SFR8(0x0191)
#define C1MASK0U SFR8(0x0192)
#define C1MASK0T SFR8(0x0193)
#define C1MASK0 SFR32(0x0190)

/* --- Filter 1 --- */
#define C1FLTOBJ1L SFR8(0x0194)
#define C1FLTOBJ1H SFR8(0x0195)
#define C1FLTOBJ1U SFR8(0x0196)
#define C1FLTOBJ1T SFR8(0x0197)
#define C1FLTOBJ1 SFR32(0x0194)

#define C1MASK1L SFR8(0x0198)
#define C1MASK1H SFR8(0x0199)
#define C1MASK1U SFR8(0x019A)
#define C1MASK1T SFR8(0x019B)
#define C1MASK1 SFR32(0x0198)

/* --- Filter 2 --- */
#define C1FLTOBJ2L SFR8(0x019C)
#define C1FLTOBJ2H SFR8(0x019D)
#define C1FLTOBJ2U SFR8(0x019E)
#define C1FLTOBJ2T SFR8(0x019F)
#define C1FLTOBJ2 SFR32(0x019C)

#define C1MASK2L SFR8(0x01A0)
#define C1MASK2H SFR8(0x01A1)
#define C1MASK2U SFR8(0x01A2)
#define C1MASK2T SFR8(0x01A3)
#define C1MASK2 SFR32(0x01A0)

/* --- Filter 3 --- */
#define C1FLTOBJ3L SFR8(0x01A4)
#define C1FLTOBJ3H SFR8(0x01A5)
#define C1FLTOBJ3U SFR8(0x01A6)
#define C1FLTOBJ3T SFR8(0x01A7)
#define C1FLTOBJ3 SFR32(0x01A4)

#define C1MASK3L SFR8(0x01A8)
#define C1MASK3H SFR8(0x01A9)
#define C1MASK3U SFR8(0x01AA)
#define C1MASK3T SFR8(0x01AB)
#define C1MASK3 SFR32(0x01A8)

/* --- Filter 4 --- */
#define C1FLTOBJ4L SFR8(0x01AC)
#define C1FLTOBJ4H SFR8(0x01AD)
#define C1FLTOBJ4U SFR8(0x01AE)
#define C1FLTOBJ4T SFR8(0x01AF)
#define C1FLTOBJ4 SFR32(0x01AC)

#define C1MASK4L SFR8(0x01B0)
#define C1MASK4H SFR8(0x01B1)
#define C1MASK4U SFR8(0x01B2)
#define C1MASK4T SFR8(0x01B3)
#define C1MASK4 SFR32(0x01B0)

/* --- Filter 5 --- */
#define C1FLTOBJ5L SFR8(0x01B4)
#define C1FLTOBJ5H SFR8(0x01B5)
#define C1FLTOBJ5U SFR8(0x01B6)
#define C1FLTOBJ5T SFR8(0x01B7)
#define C1FLTOBJ5 SFR32(0x01B4)

#define C1MASK5L SFR8(0x01B8)
#define C1MASK5H SFR8(0x01B9)
#define C1MASK5U SFR8(0x01BA)
#define C1MASK5T SFR8(0x01BB)
#define C1MASK5 SFR32(0x01B8)

/* --- Filter 6 --- */
#define C1FLTOBJ6L SFR8(0x01BC)
#define C1FLTOBJ6H SFR8(0x01BD)
#define C1FLTOBJ6U SFR8(0x01BE)
#define C1FLTOBJ6T SFR8(0x01BF)
#define C1FLTOBJ6 SFR32(0x01BC)

#define C1MASK6L SFR8(0x01C0)
#define C1MASK6H SFR8(0x01C1)
#define C1MASK6U SFR8(0x01C2)
#define C1MASK6T SFR8(0x01C3)
#define C1MASK6 SFR32(0x01C0)

/* --- Filter 7 --- */
#define C1FLTOBJ7L SFR8(0x01C4)
#define C1FLTOBJ7H SFR8(0x01C5)
#define C1FLTOBJ7U SFR8(0x01C6)
#define C1FLTOBJ7T SFR8(0x01C7)
#define C1FLTOBJ7 SFR32(0x01C4)

#define C1MASK7L SFR8(0x01C8)
#define C1MASK7H SFR8(0x01C9)
#define C1MASK7U SFR8(0x01CA)
#define C1MASK7T SFR8(0x01CB)
#define C1MASK7 SFR32(0x01C8)

/* --- Filter 8 --- */
#define C1FLTOBJ8L SFR8(0x01CC)
#define C1FLTOBJ8H SFR8(0x01CD)
#define C1FLTOBJ8U SFR8(0x01CE)
#define C1FLTOBJ8T SFR8(0x01CF)
#define C1FLTOBJ8 SFR32(0x01CC)

#define C1MASK8L SFR8(0x01D0)
#define C1MASK8H SFR8(0x01D1)
#define C1MASK8U SFR8(0x01D2)
#define C1MASK8T SFR8(0x01D3)
#define C1MASK8 SFR32(0x01D0)

/* --- Filter 9 --- */
#define C1FLTOBJ9L SFR8(0x01D4)
#define C1FLTOBJ9H SFR8(0x01D5)
#define C1FLTOBJ9U SFR8(0x01D6)
#define C1FLTOBJ9T SFR8(0x01D7)
#define C1FLTOBJ9 SFR32(0x01D4)

#define C1MASK9L SFR8(0x01D8)
#define C1MASK9H SFR8(0x01D9)
#define C1MASK9U SFR8(0x01DA)
#define C1MASK9T SFR8(0x01DB)
#define C1MASK9 SFR32(0x01D8)

/* --- Filter 10 --- */
#define C1FLTOBJ10L SFR8(0x01DC)
#define C1FLTOBJ10H SFR8(0x01DD)
#define C1FLTOBJ10U SFR8(0x01DE)
#define C1FLTOBJ10T SFR8(0x01DF)
#define C1FLTOBJ10 SFR32(0x01DC)

#define C1MASK10L SFR8(0x01E0)
#define C1MASK10H SFR8(0x01E1)
#define C1MASK10U SFR8(0x01E2)
#define C1MASK10T SFR8(0x01E3)
#define C1MASK10 SFR32(0x01E0)

/* --- Filter 11 --- */
#define C1FLTOBJ11L SFR8(0x01E4)
#define C1FLTOBJ11H SFR8(0x01E5)
#define C1FLTOBJ11U SFR8(0x01E6)
#define C1FLTOBJ11T SFR8(0x01E7)
#define C1FLTOBJ11 SFR32(0x01E4)

#define C1MASK11L SFR8(0x01E8)
#define C1MASK11H SFR8(0x01E9)
#define C1MASK11U SFR8(0x01EA)
#define C1MASK11T SFR8(0x01EB)
#define C1MASK11 SFR32(0x01E8)

/* *********************************************************************
 *
 *  CAN FD Message Object Layout (in CAN Message RAM)
 *
 *  These bit definitions describe the format of TX and RX message
 *  objects stored in the CAN message RAM.  The application reads/writes
 *  these structures through the FIFO user-address pointers (C1TXQUA,
 *  C1FIFOUAn).
 *
 *  TX Message Object (word 0, 32-bit):
 *    Bits  10:0  - SID[10:0]:  Standard Identifier
 *    Bits  28:11 - EID[17:0]:  Extended Identifier
 *    Bit   29    - SID11:      12th SID bit (if SID11EN=1)
 *
 *  TX Message Object (word 1, 32-bit):
 *    Bits   3:0  - DLC[3:0]:   Data Length Code
 *    Bit    4    - IDE:         Identifier Extension (1=extended)
 *    Bit    5    - RTR:         Remote Transmission Request
 *    Bit    6    - BRS:         Bit Rate Switch (1=switch to data rate)
 *    Bit    7    - FDF:         FD Frame (1=CAN FD, 0=CAN 2.0)
 *    Bit    8    - ESI:         Error State Indicator
 *    Bits  15:9  - SEQ[6:0]:   Sequence number (echoed back in TEF)
 *
 *  Data bytes follow starting at word 2 (byte offset 8).
 *
 * ********************************************************************* */

/* Message object word 0 (TX/RX ID word) */
#define CAN_MSG_SID_POS 0
#define CAN_MSG_SID_MASK (0x07FFu << 0)
#define CAN_MSG_EID_POS 11
#define CAN_MSG_EID_MASK (0x3FFFFu << 11)
#define CAN_MSG_SID11 (1u << 29)

