Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_can.h
/* Message object word 1 (TX/RX control word) */
#define CAN_MSG_DLC_POS 0
#define CAN_MSG_DLC_MASK (0x0Fu << 0)
#define CAN_MSG_IDE (1u << 4) /* Extended ID frame           */
#define CAN_MSG_RTR (1u << 5) /* Remote TX request           */
#define CAN_MSG_BRS (1u << 6) /* Bit Rate Switch             */
#define CAN_MSG_FDF (1u << 7) /* CAN FD frame format         */
#define CAN_MSG_ESI (1u << 8) /* Error State Indicator       */
#define CAN_MSG_SEQ_POS 9
#define CAN_MSG_SEQ_MASK (0x7Fu << 9)

/* DLC-to-byte-count mapping for CAN FD:
 *   DLC 0-8:   0-8 bytes (same as CAN 2.0)
 *   DLC 9:    12 bytes
 *   DLC 10:   16 bytes
 *   DLC 11:   20 bytes
 *   DLC 12:   24 bytes
 *   DLC 13:   32 bytes
 *   DLC 14:   48 bytes
 *   DLC 15:   64 bytes                                                 */

/* *********************************************************************
 *
 *  Bit Timing Calculation Helpers
 *
 *  The CAN bit rate is determined by:
 *    Bit Rate = Fcan / (TQ_per_bit * (BRP + 1))
 *    TQ_per_bit = Sync_Seg(1) + TSEG1 + 1 + TSEG2 + 1
 *
 *  Fcan is the CAN module clock (system clock when CLKSEL=1).
 *
 *  Example: 500 kbit/s nominal @ 64 MHz Fcan
 *    BRP=0, TSEG1=62, TSEG2=15, SJW=15
 *    TQ_per_bit = 1 + 63 + 16 = 80
 *    Bit Rate = 64 MHz / (80 * 1) = 800 kHz ... adjust as needed.
 *
 *  Refer to DS40002213D Section 29.3 for detailed bit timing examples.
 *
 * ********************************************************************* */

#endif /* PIC18F_Q84_CAN_H */
